import folium
from folium.features import DivIcon



city_map = folium.Map(location=[22.7189, 113.878588], zoom_start=10,tiles="Stamen Terrain")
#生成深圳地图


坐标信息 = [
[22.695552,113.883989,'DF34'],
[22.790839,113.867252,'JK11'],
[22.790676,113.867553,'JK14-1'],
[22.790837,113.867209,'JK15'],
[22.751997,113.875489,'JK18'],
[22.754706,113.874721,'JK45-1'],
[22.832996,113.880531,'JK2'],
[22.831935,113.880845,'JK4'],
[22.651767,113.88047,'JK33'],
[22.651627,113.880522,'JK34'],
[22.651412,113.880622,'JK35'],
[22.651438,113.881127,'JK36'],
[22.651502,113.880646,'JK37'],
[22.651516,113.880419,'JK38'],
[22.647852,113.88613,'JK41'],
[22.65149,113.880522,'ZJ6'],
[22.751802,113.875417,'JK23'],
[22.751702,113.875489,'JK20'],
[22.7189,113.878588,'Z1'],
[22.711877,113.878937,'Z18'],
[22.713281,113.879119,'Z32'],
[22.722799,113.878494,'JK31'],
[22.800398,113.874892,'D67-1'],
[22.800398,113.874892,'D67-2']
]

for 坐标点信息 in 坐标信息:
    经度,维度,编号 = 坐标点信息 

    folium.Marker(
        location=[经度,维度],
        popup="Mt. Hood Meadows",
        icon=DivIcon(icon_size=(50,36),
        html=f'<div style="font-size: 20pt">{编号}</div>',
                        ),

    ).add_to(city_map)
    #添加钻孔编号

    folium.Circle(
        radius=500,
        location=[经度,维度],
        popup="The Waterfront",
        color="crimson",
        fill=False,
    ).add_to(city_map)
    #添加钻孔位置


city_map
#更新地图
